using Tyuiu.NuryevAR.Sprint2.Task3.V15.Lib;

namespace Tyuiu.NuryevAR.Sprint2.Task3.V15
{
    internal class Program
    {
        static void Main(string[] args)
        {
            DataService ds = new DataService();
            Console.Title = "Спринт #2 | Выполнил: Нурыев А.Р. | ИИПб-24-2";
            Console.WriteLine("******************************************************************************************");
            Console.WriteLine("* Спринт #2                                                                              *");
            Console.WriteLine("* Тема: Вложенные операторы if - else                                                    *");
            Console.WriteLine("* Задание #3                                                                             *");
            Console.WriteLine("* Вариант #15                                                                            *");
            Console.WriteLine("* Выполнил: Нурыев Артём Радикович | ИИПб-24-2                                           *");
            Console.WriteLine("******************************************************************************************");
            Console.WriteLine("* УСЛОВИЕ:                                                                               *");
            Console.WriteLine("* Написать программу, которая вычисляет требуемое значение функции Y с использованием    *\n" +
                "вложенных оператор if-else, где пользователь вводит значение переменной X с клавиатуры   *\n" +
                " Округлить полученное значение до трех знаков после запятой;                             *");
            Console.WriteLine("******************************************************************************************");
            Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                       *");
            Console.WriteLine("******************************************************************************************");
            Console.WriteLine("* Введите значение переменной x:                                                         *");
            int x = Convert.ToInt32(Console.ReadLine());
            var res = ds.Calculate(x);
            Console.WriteLine("******************************************************************************************");
            Console.WriteLine("******************************************************************************************");
            Console.WriteLine("* РЕЗУЛЬТАТ:                                                                             *");
            Console.WriteLine($"* Значение функции = {res}                                                              *");
            Console.WriteLine("******************************************************************************************");
        }
    }
}
